### Apply Map and Deal with Null data in your same datasets
Datasets used :
1. Titanic Dataset : https://raw.githubusercontent.com/shivshaktisahoo/test/main/titanic.csv
2. Real Estate Price Prediction: https://raw.githubusercontent.com/shivshaktisahoo/test/main/Real%20estate.csv
3. Medical Cost Personal Datasets: https://raw.githubusercontent.com/shivshaktisahoo/test/main/insurance.csv

1. Titanic.csv file (using map and deal NAN)
2. Real Estate .csv file (no need for map and can't deal with NAN as no such values in datasets)
3. Medical Cost Personal.csv file (using map and can't deal with NAN as no such values in datasets)

In [ ]:
# Importing Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.rcParams["figure.figsize"] = (15,5)
import sklearn
from sklearn.linear_model import LinearRegression
import random

### 1. Titanic Dataset

In [ ]:
dataset1 = pd.read_csv('https://raw.githubusercontent.com/shivshaktisahoo/test/main/titanic.csv')
dataset1.sample(5)

     PassengerId  Survived  Pclass  ...     Fare    Cabin  Embarked
298          299         1       1  ...  30.5000     C106         S
97            98         1       1  ...  63.3583  D10 D12         C
832          833         0       3  ...   7.2292      NaN         C
859          860         0       3  ...   7.2292      NaN         C
395          396         0       3  ...   7.7958      NaN         S

[5 rows x 12 columns]

In [ ]:
dataset1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
# No.of null values in each columns/attributes
dataset1.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
# Age contains NAN
dataset1[16:21]

    PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
16           17         0       3  ...  29.125   NaN         Q
17           18         1       2  ...  13.000   NaN         S
18           19         0       3  ...  18.000   NaN         S
19           20         1       3  ...   7.225   NaN         C
20           21         0       2  ...  26.000   NaN         S

[5 rows x 12 columns]

In [ ]:
# Replacing NAN values with mean values of Age column
age_mean = dataset1.Age.describe()['mean'] 
dataset1['Age'] = dataset1['Age'].fillna(age_mean)
dataset1[16:21]

    PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
16           17         0       3  ...  29.125   NaN         Q
17           18         1       2  ...  13.000   NaN         S
18           19         0       3  ...  18.000   NaN         S
19           20         1       3  ...   7.225   NaN         C
20           21         0       2  ...  26.000   NaN         S

[5 rows x 12 columns]

In [ ]:
# Replacing NAN values with top values of Embarked column
dataset1['Embarked'] = dataset1['Embarked'].fillna(dataset1.Embarked.describe()['top'])

In [ ]:
dataset1 = dataset1.drop(columns='Cabin') # Removing column Cabin
dataset1.isna().sum() # All NAN values handled properly and resolved

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
dataset1['Sex'] = dataset1['Sex'].map({"male":0, "female":1})

In [ ]:
dataset1

     PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0              1         0       3  ...         A/5 21171   7.2500         S
1              2         1       1  ...          PC 17599  71.2833         C
2              3         1       3  ...  STON/O2. 3101282   7.9250         S
3              4         1       1  ...            113803  53.1000         S
4              5         0       3  ...            373450   8.0500         S
..           ...       ...     ...  ...               ...      ...       ...
886          887         0       2  ...            211536  13.0000         S
887          888         1       1  ...            112053  30.0000         S
888          889         0       3  ...        W./C. 6607  23.4500         S
889          890         1       1  ...            111369  30.0000         C
890          891         0       3  ...            370376   7.7500         Q

[891 rows x 11 columns]

In [ ]:
x = dataset1.drop(['Name', 'Ticket', 'Embarked'], axis=1)

In [ ]:
x.info() # all are non-numeric types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    int64
 4   Age          891 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Fare         891 non-null    float64
dtypes: float64(2), int64(6)
memory usage: 55.8 KB

### 2. Real Estate Price Prediction

In [ ]:
dataset2 = pd.read_csv("https://raw.githubusercontent.com/shivshaktisahoo/test/main/Real%20estate.csv")
dataset2.head()

   No  X1 transaction date  ...  X6 longitude  Y house price of unit area
0   1             2012.917  ...     121.54024                        37.9
1   2             2012.917  ...     121.53951                        42.2
2   3             2013.583  ...     121.54391                        47.3
3   4             2013.500  ...     121.54391                        54.8
4   5             2012.833  ...     121.54245                        43.1

[5 rows x 8 columns]

In [ ]:
dataset2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 414 entries, 0 to 413
Data columns (total 8 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   No                                      414 non-null    int64
 1   X1 transaction date                     414 non-null    float64
 2   X2 house age                            414 non-null    float64
 3   X3 distance to the nearest MRT station  414 non-null    float64
 4   X4 number of convenience stores         414 non-null    int64
 5   X5 latitude                             414 non-null    float64
 6   X6 longitude                            414 non-null    float64
 7   Y house price of unit area              414 non-null    float64
dtypes: float64(6), int64(2)
memory usage: 26.0 KB

In [ ]:
# no NAN values
# not required map

### 3. Medical Cost Personal Datasets

In [ ]:
dataset3 = pd.read_csv("https://raw.githubusercontent.com/shivshaktisahoo/test/main/insurance.csv")
dataset3

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [ ]:
dataset3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [ ]:
dataset3.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

no NAN values in datasets.

using map on columns - sex,	smoker,	region

In [ ]:
dataset3['sex'] = dataset3['sex'].map({"male":0, "female":1})
dataset3['smoker'] = dataset3['smoker'].map({"no":0, "yes":1})
dataset3['region'] = dataset3['region'].map({'southwest':1, 'southeast':2, 'northwest':3, 'northeast':4})

In [ ]:
dataset3

      age  sex     bmi  children  smoker  region      charges
0      19    1  27.900         0       1       1  16884.92400
1      18    0  33.770         1       0       2   1725.55230
2      28    0  33.000         3       0       2   4449.46200
3      33    0  22.705         0       0       3  21984.47061
4      32    0  28.880         0       0       3   3866.85520
...   ...  ...     ...       ...     ...     ...          ...
1333   50    0  30.970         3       0       3  10600.54830
1334   18    1  31.920         0       0       4   2205.98080
1335   18    1  36.850         0       0       2   1629.83350
1336   21    1  25.800         0       0       1   2007.94500
1337   61    1  29.070         0       1       3  29141.36030

[1338 rows x 7 columns]

In [ ]:
# all columns converted to numeric type